resources/receipt-templates/epson/return-receipt.xml

<?xml version="1.0" encoding="utf-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><epos-print xmlns="http://www.epson-pos.com/schemas/2011/03/epos-print">
<feed line="1"/>
{{#store_logo_base64}}
<image width="{{store_logo_width}}" height="{{store_logo_height}}">{{store_logo_base64}}</image>
{{/store_logo_base64}}
{{^store_logo_base64}}
<logo key1="34" key2="48"/>
{{/store_logo_base64}}
<feed line="2"/>
<text lang="en"/>
<text width="1" height="1"/>
<text reverse="false" ul="false" em="true" color="color_1"/>
<text>{{store_name}}</text>
<feed/>
<text reverse="false" ul="false" em="false" color="color_1"/>
<text>Org.nr.: {{organization_number}} MVA</text>
{{#store_address}}
<feed/>
<text lang="en"/>
<text>{{store_address}}</text>
{{/store_address}}
<feed line="2"/>
<text width="1" height="1"/>
<text reverse="false" ul="false" em="true" color="color_1"/>
<text>RETURKVITTERING</text>
<feed line="1"/>
<text lang="en"/>
<text reverse="false" ul="false" em="false" color="color_1"/>
<text>Kasse-ID: {{session_number}}   Ansatt: {{cashier_name}}</text>
<feed/>
<text lang="en"/>
<text>Transaksjons-ID: {{transaction_id}}</text>
<feed/>
<text lang="en"/>
<text>Dato: {{date_time}}</text>
{{#customer_name}}
<feed/>
<text>Kunde: {{customer_name}}</text>
{{/customer_name}}
{{#customer_phone}}
<feed/>
<text>Telefon: {{customer_phone}}</text>
{{/customer_phone}}
{{#customer_email}}
<feed/>
<text>E-post: {{customer_email}}</text>
{{/customer_email}}
<feed/>
{{#original_receipt_number}}
<text>Original kvittering: {{original_receipt_number}}</text>
<feed/>
{{/original_receipt_number}}
<text>—————————————————————————————————————————————</text>
<feed/>
<feed/>
{{#items}}
{{#formatted_line}}
<text>{{formatted_line}}</text>
{{/formatted_line}}
{{^formatted_line}}
<text>{{name}}        {{quantity}} x -{{unit_price}}</text>
{{/formatted_line}}
{{#description_line}}
<feed/>
<text>{{description_line}}</text>
{{/description_line}}
<feed/>
<text lang="en"/>
{{/items}}
<text lang="en"/>
<text>—————————————————————————————————————————————</text>
<feed/>
<text reverse="false" ul="false" em="true" color="color_1"/>
<text>Total                        -{{total_amount}} {{currency}}</text>
<feed/>
<text>—————————————————————————————————————————————</text>
<feed/>
<text lang="en"/>
<text reverse="false" ul="false" em="true" color="color_1"/>
<text>MVA-sats(Grunnlag)                     MVA</text>
<feed/>
<text>{{vat_rate}}%(-{{vat_base}})                        -{{vat_amount}}</text>
<feed/>
<feed/>
<text>Betalingsmiddel: Tilbakeført til {{payment_method_display}}</text>
<feed/>
<text>Returbeløp: {{currency}} -{{total_amount}}</text>
<feed line="2"/>
<barcode type="code128_auto" hri="none" font="font_a" width="2" height="40">{{receipt_number}}</barcode>
<feed/>
<text>—————————————————————————————————————————————</text>
<text>Takk for besøket, velkommen igjen!</text>
<feed/>
<feed/>
<cut type="feed"/>
</epos-print></s:Body></s:Envelope>
